Tekla Open API Reference for Tekla Structures 2025
Arc.Select Method
 Calls the system to select and retrieve the object.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override bool Select()
Public Overrides Function Select As Boolean
Return Value
Type: Boolean
True on success.
See Also
Reference
Arc Class
Tekla.Structures.Drawing Namespace